In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('titanic3.csv')

In [5]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [9]:
df1=df.drop(['pclass','name','sibsp', 'parch','ticket', 'cabin', 'embarked', 'boat','body', 'home.dest'], axis='columns')
df1.head()

   survived     sex      age      fare
0       1.0  female  29.0000  211.3375
1       1.0    male   0.9167  151.5500
2       0.0  female   2.0000  151.5500
3       0.0    male  30.0000  151.5500
4       0.0  female  25.0000  151.5500

In [11]:
dummies=pd.get_dummies(df1.sex)
dummies.head()

   female  male
0       1     0
1       0     1
2       1     0
3       0     1
4       1     0

In [14]:
df2=pd.concat([df1, dummies], axis='columns')
df2

      survived     sex      age      fare  female  male
0          1.0  female  29.0000  211.3375       1     0
1          1.0    male   0.9167  151.5500       0     1
2          0.0  female   2.0000  151.5500       1     0
3          0.0    male  30.0000  151.5500       0     1
4          0.0  female  25.0000  151.5500       1     0
...        ...     ...      ...       ...     ...   ...
1305       0.0  female      NaN   14.4542       1     0
1306       0.0    male  26.5000    7.2250       0     1
1307       0.0    male  27.0000    7.2250       0     1
1308       0.0    male  29.0000    7.8750       0     1
1309       NaN     NaN      NaN       NaN       0     0

[1310 rows x 6 columns]

In [16]:
df3=df2.drop(['sex'], axis='columns')
df3.head()

   survived      age      fare  female  male
0       1.0  29.0000  211.3375       1     0
1       1.0   0.9167  151.5500       0     1
2       0.0   2.0000  151.5500       1     0
3       0.0  30.0000  151.5500       0     1
4       0.0  25.0000  151.5500       1     0

In [21]:
df3.columns[df3.isna().any()]

Index(['survived', 'age', 'fare'], dtype='object')

In [27]:
df3.head(10)

   survived      age      fare  female  male
0       1.0  29.0000  211.3375       1     0
1       1.0   0.9167  151.5500       0     1
2       0.0   2.0000  151.5500       1     0
3       0.0  30.0000  151.5500       0     1
4       0.0  25.0000  151.5500       1     0
5       1.0  48.0000   26.5500       0     1
6       1.0  63.0000   77.9583       1     0
7       0.0  39.0000    0.0000       0     1
8       1.0  53.0000   51.4792       1     0
9       0.0  71.0000   49.5042       0     1

In [35]:
df3.age=df3.age.fillna(df3.age.mean())
df3.fare=df3.fare.fillna(df.fare.mean())

In [36]:
df3.columns[df3.isna().any()]

Index(['survived'], dtype='object')

In [37]:
df3

      survived        age        fare  female  male
0          1.0  29.000000  211.337500       1     0
1          1.0   0.916700  151.550000       0     1
2          0.0   2.000000  151.550000       1     0
3          0.0  30.000000  151.550000       0     1
4          0.0  25.000000  151.550000       1     0
...        ...        ...         ...     ...   ...
1305       0.0  29.881135   14.454200       1     0
1306       0.0  26.500000    7.225000       0     1
1307       0.0  27.000000    7.225000       0     1
1308       0.0  29.000000    7.875000       0     1
1309       NaN  29.881135   33.295479       0     0

[1310 rows x 5 columns]

In [39]:
df3.isna().any()

survived     True
age         False
fare        False
female      False
male        False
dtype: bool

In [42]:
df4=df3.dropna()

In [43]:
df4.isna().any()

survived    False
age         False
fare        False
female      False
male        False
dtype: bool

In [53]:
X=df4.drop(['survived'], axis='columns')
Y=df4.survived

In [54]:
from sklearn.model_selection import train_test_split

In [55]:
X_train, X_test, Y_train, Y_test=train_test_split(X,Y, test_size=0.2)

In [56]:
len(X_test)

262

In [57]:
from sklearn.naive_bayes import GaussianNB

In [58]:
model=GaussianNB()

In [59]:
model.fit(X_train, Y_train)

GaussianNB()

In [60]:
model.score(X_test,Y_test)

0.7633587786259542

In [65]:
model.predict_proba(X_test[:10])

array([[5.12692705e-02, 9.48730730e-01],
       [9.75781061e-01, 2.42189387e-02],
       [5.21406949e-02, 9.47859305e-01],
       [9.79988224e-01, 2.00117758e-02],
       [9.79257325e-01, 2.07426751e-02],
       [9.59557297e-01, 4.04427028e-02],
       [5.03735473e-02, 9.49626453e-01],
       [4.67185754e-04, 9.99532814e-01],
       [3.41869712e-02, 9.65813029e-01],
       [9.78694807e-01, 2.13051926e-02]])